Процедура ОбработкаПроведения(Отказ, Режим)
	
	// 1. Включаем запись движений
	Движения.Затраты.Записывать = Истина;
	
	// 2. Проходим по каждой строке табличной части "Затраты"
	Для Каждого ТекСтрока Из Затраты Цикл
		
		Движение = Движения.Затраты.Добавить();
		
		// Заполняем измерения
		Движение.Период = Дата;                // В факте дата берется из стандартного реквизита "Дата"
		Движение.Участок = Участок;
		Движение.Статья = ТекСтрока.Статья;
		
		// Заполняем тип
		Движение.Тип = "Факт";
		
		// Заполняем ресурсы
		Движение.Сумма = ТекСтрока.Сумма;
		Движение.Количество = ТекСтрока.Количество;
		
	КонецЦикла;
	
КонецПроцедуры